{
  "projects": {
    "logofolio": {
      "meta": {
        "title": "Logofolio",
        "description": "A curated collection of timeless logos and brand marks, showcasing my talent for crafting distinctive visual identities that resonate across a wide array of industries, delivering clarity and character through design.",
        "speed": 0.5,
        "url": "/project/logofolio"
      },
      "project": [
        {
          "images": {
            "white": "/images/logofolio/visionz-bw.png",
            "black": "/images/logofolio/visionz-color.png"
          },
          "title": "Visionz & Vibez",
          "description": "A modern photography brand capturing authentic moments with style and soul—tailored for events, portraits, and creative storytelling."
        },
        {
          "images": {
            "white": "/images/logofolio/eg-bw.png",
            "black": "/images/logofolio/eg-color.png"
          },
          "title": "Ebony Gonsalves",
          "description": "A personal beauty brand offering professional makeup services with a signature touch of glam, precision, and confidence."
        },
        {
          "images": {
            "white": "/images/logofolio/islaybox-bw.png",
            "black": "/images/logofolio/islaybox-color.png"
          },
          "title": "iSlay",
          "description": "A beauty brand empowering self-expression through premium wigs, lashes, and hair products—where every look slays."
        },
        {
          "images": {
            "white": "/images/logofolio/seasons-bw.png",
            "black": "/images/logofolio/seasons-color.png"
          },
          "title": "Seasons",
          "description": "A culinary brand and restaurant serving upscale dishes infused with rich flavor profiles and creative use of global seasonings."
        },
        {
          "images": {
            "white": "/images/logofolio/waggy-bw.png",
            "black": "/images/logofolio/waggy-color.png"
          },
          "title": "Waggy Walks ATL",
          "description": "An Atlanta-based pet care brand offering walking, daycare, and sitting services for four-legged family members—with love and consistency."
        },
        {
          "images": {
            "white": "/images/logofolio/aayd-bw.png",
            "black": "/images/logofolio/aayd-color.png"
          },
          "title": "All About You Designs",
          "description": "A print brand that brings your homemade creations to life on custom tees, mugs, and more—designed by you, made by us."
        },
        {
          "images": {
            "white": "/images/logofolio/AVX-Studios-white.png",
            "black": "/images/logofolio/AVX-Studios-black.png"
          },
          "title": "AVX Studios",
          "description": "A creative agency specializing in branding, audio, and marketing design—helping brands grow through storytelling and sharp visual identity."
        },
        {
          "images": {
            "white": "/images/logofolio/PN-white.png",
            "black": "/images/logofolio/PN-black.png"
          },
          "title": "Patricia Nicolas",
          "description": "A media brand delivering bold commentary and cultural insight on news, trends, and social issues from a sharp, unapologetic perspective."
        }
      ]
    },
    "anarose": {
      "meta": {
        "title": "Ana Rose",
        "description": "A cohesive brand identity, website, and seamless online booking system designed to help this Dallas cleaning service grow its residential and commercial client base.",
        "speed": 0.5,
        "url": "/project/anarose"
      },
      "project": [
        {
          "image": "/images/Ana-Rose-residential.png",
          "title": "Brief",
          "description": "Ana Rose is a Dallas-based cleaning service brand founded by a solo entrepreneur looking to grow beyond word-of-mouth referrals. Originally focused on small residential cleanings, Ana Rose aimed to elevate its brand, streamline operations, and expand into larger residential projects and commercial contracts. I partnered with the founder to design a cohesive brand identity, build a modern website, and develop an online booking experience tailored to her target clientele.",
          "goals": "•\tRefresh the brand to feel professional, trustworthy, and scalable\n•\tLaunch a website with built-in scheduling and quote requests\n•\tSupport expansion into higher-value residential and commercial markets",
          "challenges": "•\tNo existing brand identity or web presence\n•\tManual scheduling limited growth and responsiveness\n•\tNeeded to appeal to both home and business clients",
          "solutions": "•\tDesigned a clean, modern logo and visual system\n•\tBuilt a responsive website with online booking and service breakdowns\n•\tCrafted messaging and design that bridges residential warmth with commercial credibility"
        },
        {
          "image": "/images/Ana-Rose-booking.png",
          "title": "Web Application (How-To-Guide)",
          "description": "A simple step-by-step guide that helps users easily navigate and book Ana Rose’s cleaning services online."
        },
        {
          "image": "/images/Ana-Rose-modal-two.png",
          "title": "Web Application (Service-Description)",
          "description": "An overview of Ana Rose’s residential and commercial cleaning services with clear, client-focused descriptions."
        },
        {
          "image": "/images/Ana-Rose-faqs.png",
          "title": "Web Application (Custom-Services)",
          "description": "A customizable service builder that lets users tailor cleaning packages to their specific home or business needs."
        },
        {
          "image": "/images/Ana-Rose-reviews.png",
          "title": "Web Application (Testimonials)",
          "description": "A collection of real client testimonials that showcase trust, satisfaction, and proven cleaning results."
        }
      ]
    },
    "queendomfarms": {
      "meta": {
        "title": "Queendom Farms",
        "description": "A strong visual brand and logo system created to authentically represent this women-led urban farm’s mission and audience.",
        "speed": 0.67,
        "url": "/project/queendomfarms"
      },
      "project": [
        {
          "image": "/images/Queendom-Farms-Home.jpg",
          "title": "Brief",
          "description": "Queendom Farms is an urban flower and fruit farm based in Georgia, aiming to establish itself in an industry traditionally dominated by men. Founded by two women inspired and empowered by agriculture, they set out to create a strong and authentic brand identity of their own",
          "goals": "•\tEstablish a bold, authentic brand rooted in empowerment and agriculture.\n•\tDifferentiate Queendom in a male-dominated farming industry.\n•\tCreate a visual identity that reflects both strength and natural beauty.",
          "challenges": "•\tEntering a competitive space with limited existing brand recognition.\n•\tBalancing femininity and authority in a traditionally rugged market.\n•\tCommunicating values of sustainability, empowerment, and quality in a cohesive way.",
          "solutions": "•\tDeveloped a confident and earthy visual identity that honors both founders’ spirit and the land.\n•\tCrafted brand language that celebrates women in agriculture without relying on stereotypes.\n•\tBuilt a brand system that’s flexible across packaging, signage, digital, and farmers market presence."
        },
        {
          "image": "/images/Queendom-Farms-inspiration.jpg",
          "title": "Moodboard",
          "description": "A visual collage capturing the brand’s essence—rooted in nature, empowerment, and modern femininity.\n\n—\n\nThis moodboard set the foundation for Queendom Farms’ visual identity, blending organic textures, modern femininity, and themes of growth to visually align with the brand’s mission."
        },
        {
          "image": "/images/Queendom-Farms-persona.jpg",
          "title": "User Persona",
          "description": "A detailed profile outlining the brand’s target audience, needs, values, and buying behaviors.\n\n—\n\nDeveloped through audience research, this persona defines key motivations, lifestyle choices, and purchasing habit. This ensures that the brand resonates authentically with its core audience."
        },
        {
          "image": "/images/Queendom-Farms-user.jpg",
          "title": "User Persona",
          "description": "A visual representation of Queendom Farms' ideal customer, crafted to guide brand decisions.\n\n—\n\nA composite visual of Queendom Farms’ ideal customer, helping guide tone, aesthetic, and messaging decisions from brand voice to UX flow."
        },
        {
          "image": "/images/Queendom-Farms-sketch.jpg",
          "title": "Sketch & Prototypes",
          "description": "Early logo sketches and digital prototypes exploring symbolism, balance, and brand voice.\n\n—\n\nWith the initial sketches I wanted to explore symbols of strength and cultivation that evolved into digital prototypes that required being tested for its ingenuity, uniqueness, and scalability across real-world applications."
        },
        {
          "image": "/images/Queendom-Farms-final.jpg",
          "title": "The Logo",
          "description": "The official Queendom Farms logo—a bold, elegant mark reflecting strength and authenticity.\n\n—\n\nThe final logo balances regal strength with organic elegance—capturing Queendom Farms’ essence as a bold, women-led agricultural brand."
        },
        {
          "image": "/images/Queendom-Farms-formats.jpg",
          "title": "Formats",
          "description": "Multiple logo file types and layouts for flexible use across packaging, web, and print.\n\n—\n\nDesigned for versatility, logo assets were delivered in various formats to ensure consistency across digital, print, and product-based branding."
        },
        {
          "image": "/images/Queendom-Farms-type.jpg",
          "title": "TypeFace",
          "description": "A custom font pairing chosen for legibility and style, reinforcing the brand’s grounded tone.\n\n—\n\nThis clean yet grounded font pairing was selected for readability and warmth that would go on to support brand storytelling across packaging, signage, and digital platforms."
        },
        {
          "image": "/images/Queendom-Farms-guide.jpg",
          "title": "Colors",
          "description": "A warm, earthy color palette inspired by organic growth, soil, and harvest seasons.\n\n—\n\nAn earthy, seasonal palette communicates authenticity and sustainability while enhancing recognition and emotional resonance with the target audience."
        },
        {
          "image": "/images/Queendom-Farms-variants.jpg",
          "title": "Logo Variations",
          "description": "Alternate logo versions optimized for light, dark, small-scale, and vertical applications.\n\n—\n\nEach variation ensures brand consistency across all environments. Whether on small-scale tags, dark-mode websites, or vertical packaging, we wanted to make sure all bases were covered for these underdogs and soon-to-be champions."
        },
        {
          "image": "/images/Queendom-Farms-product.jpg",
          "title": "Moodboard",
          "description": "An extended brand moodboard showing lifestyle inspiration, textures, and tone.\n\n—\n\nThis extended board reinforces the brand’s visual direction, drawing from real textures, natural settings, and lifestyle cues to support design decisions."
        },
        {
          "image": "/images/Queendom-Farms-products.jpg",
          "title": "Brand Application",
          "description": "Real-world mockups of the Queendom Farms brand across packaging, merchandise, and social media."
        },
        {
          "image": "/images/Queendom-Farms-package.jpg",
          "title": "Brand Application",
          "description": "Real-world mockups of the Queendom Farms brand across packaging, merchandise, and social media."
        },
        {
          "image": "/images/Queendom-Farms-packaging.jpg",
          "title": "Brand Application",
          "description": "Real-world mockups of the Queendom Farms brand across packaging, merchandise, and social media."
        }
      ]
    },
    "epicfuture": {
      "meta": {
        "title": "Epic Future",
        "description": "A versatile entertainment brand developed with culturally inspired logos and apparel designs, establishing a bold presence across key U.S. cities.",
        "speed": 0.8,
        "url": "/project/epicfuture"
      },
      "project": [
        {
          "image": "/images/EpicFuture.png",
          "title": "Brief",
          "description": "Epic Future was born from a vision: to create a bold entertainment brand that could live beyond the stage—on apparel, in culture, and in city streets. Founded by a Haitian-born creative, the brand needed to feel global, yet deeply personal.",
          "goals": "•\tCreate a brand fit for apparel, jewelry, and media.\n•\tDesign a bold “EFE” submark for lifestyle use.\n•\tReflect Haitian heritage through color.",
          "challenges": "•\tBalancing streetwear and luxury in one mark.\n•\tHonoring culture without clichés.\n•\tKeeping city visuals distinct but unified.",
          "solutions": "•\tBuilt a dual-logo system: Epic Future + EFE.\n•\tUsed a modernized Haitian color palette.\n•\tDesigned landmark-based EFE visuals per city.\n•\tDelivered a flexible, cross-market brand system.",
          "video": ""
        },
        {
          "image": "/images/EpicFuture-moodboard.png",
          "title": "Moodboard",
          "description": "A visual foundation capturing the brand’s essence—bold, modern, and culturally rooted.\n\n—\n\nThe moodboard was crafted to evoke a sense of movement and cultural pride, setting the tone for a brand that feels both contemporary and deeply connected to its roots."
        },
        {
          "image": "/images/EpicFuture-user-type-1.png",
          "title": "User Persona",
          "description": "A detailed profile of the brand’s target audience, capturing their lifestyle, values, and cultural connections.\n\n—\n\nBrianna’s values pushed the brand to reflect more than visual style. It needed to carry purpose, inclusion, and a bold point of view. Her perspective influenced everything from logo adaptability to messaging tone, aligning the brand with a generation seeking meaning in self-expression."
        },
        {
          "image": "/images/EpicFuture-user-type-2.png",
          "title": "User Persona",
          "description": "A detailed persona capturing a trend-forward creative who values authenticity, cultural relevance, and local pride.\n\n--\n\nDesigning for Malik ensured the brand communicated with culturally fluent streetwear consumers who seek meaning in every design choice. His lens helped shape Epic Future into a movement, not just merchandise, rooted in identity, heritage, and credibility."
        },
        {
          "image": "/images/EpicFuture-bw.png",
          "title": "Logo Variant (Full)",
          "description": "Clean black and white versions of the Epic Future logo showcasing its versatility across digital and physical formats.\n\n—\n\nBy starting with a stripped-down version, we ensured the logo’s core identity could stand alone without color or effects, furthermore, proving its dominance, precision, and scalability in any environment."
        },
        {
          "image": "/images/EpicFuture-cities.png",
          "title": "Logo Variant (City-Collab)",
          "description": "Masked logo variants featuring iconic city landmarks to localize the Epic Future brand in key cultural hubs.\n\n—\n\nLocalizing the brand with city-inspired masks bridges cultural relevance with visual storytelling, allowing Epic Future to resonate authentically with diverse audiences while maintaining a cohesive identity system."
        },
        {
          "image": "/images/EpicFuture-Eight.png",
          "title": "Logo Variant (Acronym)",
          "description": "A dynamic EFE emblem using masked letterforms from each city variant and colored with the Haitian flag to honor heritage.\n\n—\n\nThe choice to unify the acronym using masked fragments from different city variants and the Haitian flag was a deliberate cultural nod to celebrate heritage while remembering to reinforce community, pride, and movement across borders."
        },
        {
          "image": "/images/EpicFuture-styles.png",
          "title": "Brand Application",
          "description": "Branded t-shirt mockups displaying the Epic Future and EFE logos in fashion-forward streetwear contexts.\n\n—\n\nStreetwear served as the ideal medium to validate the logo’s visual weight and flexibility, which serves the purpose to transform design into a lifestyle while also testing how well the identity holds up in real-world, trend-driven spaces."
        },
        {
          "title": "Brand Application",
          "description": "Video preview of a model wearing an EFE-marked hoodie, highlighting logo impact in motion and lifestyle branding.\n\n—\n\nThe video format was strategically used to demonstrate motion adaptability and emotional resonance, allowing the brand to be experienced as more than a static mark, but one that lives and breathes through everyday expression.",
          "video": "/images/videos/EpicFuture-clip.mp4"
        }
      ]
    },
    "consolidatedconstructionsolutions": {
      "meta": {
        "title": "Consolidated Construction",
        "description": "A professional corporate brand package and user-friendly website delivered to position this Houston construction firm for growth in residential and commercial markets.",
        "speed": 0.8,
        "url": "/project/consolidatedconstructionsolutions"
      },
      "project": [
        {
          "image": "/images/CCS.png",
          "title": "Brief",
          "description": "Consolidated Construction Solutions is a Houston-based, family-driven firm offering architectural and construction services across both residential and commercial markets. Built on trust, craftsmanship, and professionalism, the brand needed a refined identity and online presence to reflect its values and support future growth.",
          "goals": "•\tBuild a clean, trustworthy brand for residential and commercial clients\n•\tLaunch a website with scheduling, quote generation, and project showcase\n•\tCreate branded materials for on-site, digital, and social visibility",
          "challenges": "•\tBalance a professional tone with family-oriented values\n•\tAppeal to a broad audience—from homeowners to commercial developers\n•\tDeliver a full brand system within a limited timeline and budget",
          "solutions": "•\tDesigned a refined identity using warm, business-class color tones\n•\tDeveloped a responsive website with key client-facing features\n•\tDelivered a full branding package: stationery, apparel, magnets, and social templates"
        },
        {
          "image": "/images/CCS-Imagery.png",
          "title": "Moodboard",
          "description": "A visual direction board reflecting the brand’s clean, professional aesthetic and construction industry roots.\n\n—\n\nCurated to evoke reliability and precision, the moodboard established a visual tone rooted in structure, professionalism, and the no-nonsense aesthetics of commercial and residential construction."
        },
        {
          "image": "/images/CCS-sketch.png",
          "title": "Sketch & Prototype",
          "description": "Hand-drawn sketches were used to explore foundational imagery such as emblems, framing structures, and monogram concepts that aligned with the brand's emphasis on precision, strength, and reliability.\n\n--\n\nEarly sketching explored structural forms and bold shapes, which drew inspiration from elements that the client provided, using framing beams, shapes, and blueprint geometry. The goal was to create a visual foundation that felt solid, recognizable, and deeply tied to the industry."
        },
        {
          "image": "/images/CCS-prototypes.png",
          "title": "Sketch & Prototype",
          "description": "Digitally rendered prototypes refined to meet the standards of clean linework, sharp edges, and scalable composition to test against real-world applications.\n\n--\n\nThe prototyping phase served as a stress test for the brand’s visual identity. Each variation was evaluated for legibility at multiple sizes, color contrast for field visibility, and visual harmony within layout constraints typical of construction signage and corporate collateral. This ensured the final mark wouldn’t just look good in isolation but in environments where the brand would live and operate. "
        },
        {
          "image": "/images/CCS-Logo.png",
          "title": "Logo Formats",
          "description": "Primary and alternate logo formats built for flexibility across digital, signage, and print applications.\n\n—\n\nThe selected mark balances corporate polish with industrial grit, optimized in multiple formats to ensure clarity and consistency across print, apparel, digital interfaces, and environmental branding."
        },
        {
          "image": "/images/CCS-Identity_.png",
          "title": "Company Colors & Typeface",
          "description": "A business-forward color palette and sturdy typeface selected to convey trust, structure, and professionalism.\n\n—\n\nA canary yellow to capture attention, a chestnut brown to establish trust and reliability, and a steel gray palette was paired with a strong, utilitarian typeface to visually reinforce the brand’s commitment to integrity, craftsmanship, and professionalism in the construction space."
        },
        {
          "image": "/images/CCS-kit.png",
          "title": "Stationery Kit",
          "description": "Branded stationery designs including letterhead, business cards, and job-site documents for a unified identity.\n\n—\n\nBranded business materials were designed to carry the same sense of order and clarity, streamlining the company’s client touchpoints while maintaining an environmentally friendly business by using recycled paper to maintain a consistent visual identity on-site and in the office."
        },
        {
          "image": "/images/CCS-Mocks.png",
          "title": "Brand Application",
          "description": "Mockups showcasing the logo applied to work shirts, company gear, and banners.\n\n—\n\nRealistic brand mockups were applied across high-impact surfaces, like crew uniforms and banners, to showcase the brand’s cohesion in client-facing and operational contexts, increasing brand recognition on job sites."
        },
        {
          "image": "/images/CCS-website.png",
          "title": "Web Application",
          "description": "A user-friendly website concept with scheduling, quote generation, and project showcase features.\n\n—\n\nDesigned with conversion and usability in mind, the site concept integrates intuitive quote requests, service explanations, and visual project showcases to improve trust, navigation, and lead generation.",
          "link": "https://cnsldconstruction.com"
        }
      ]
    },
    "perfectlydifferent": {
      "meta": {
        "title": "Perfectly Different",
        "description": "An inclusive dating app concept designed with user research, personas, and UI prototypes to serve individuals with disabilities authentically and effectively.",
        "speed": 1.2,
        "url": "/project/perfectlydifferent"
      },
      "project": [
        {
          "image": "/images/perfectly-different.png",
          "title": "Brief",
          "description": "Perfectly Different is a dating app concept built for people with disabilities—created to foster real, human connection in a digital world often shaped by superficial standards. What started as a friend’s idea grew into a passion project focused on inclusion, empathy, and authentic interaction.",
          "goals": "•\tCreate a safe, inclusive space for people with disabilities to connect\n•\tBuild awareness through media and storytelling\n•\tMonetize through sponsorships instead of user fees",
          "challenges": "•\tMarketing to an audience often overlooked or misrepresented\n•\tDesigning a dating experience free from vanity-based interactions\n•\tBalancing accessibility, usability, and emotional sensitivity",
          "solutions": "•\tConducted 1-on-1 interviews to define user needs and experiences\n•\tMapped requirements, business goals, and user personas\n•\tDesigned a UI prototype centered on meaningful, accessible interaction"
        },
        {
          "image": "/images/Perfectly-Different-quote.png",
          "title": "Moodboard",
          "description": "A visual foundation capturing the inclusive, empowering, and human-centered spirit of the brand.\n\n—\n\nDesigned to evoke warmth and belonging, the moodboard sets an emotional foundation to inspire design choices that reflect inclusivity and empowerment."
        },
        {
          "image": "/images/Perfectly-Different-requirements.png",
          "title": "Business Requirements",
          "description": "Key structural and functional goals were defined to support app development and user safety.\n\n—\n\nWe defined clear objectives to ensure that every feature supports user safety, accessibility, and authentic connection to meet the real needs of an underserved audience."
        },
        {
          "image": "/images/Perfectly-Different-needs.png",
          "title": "Business Needs",
          "description": "Core business objectives driving product design, marketing, and community engagement.\n\n—\n\nPrioritized functionality and accessibility standards to ensure the app offers intuitive, barrier-free spaces for users with various physical and cognitive requirements."
        },
        {
          "image": "/images/Perfectly-Different-research.png",
          "title": "Business Voice, Tone, & Personality",
          "description": "A brand voice developed to be empathetic, honest, and confidently inclusive.\n\n—\n\nThe empathetic tone was intentionally chosen to reflect the brand’s mission, which is sure to create a space where users feel seen, heard, and respected from first interaction."
        },
        {
          "image": "/images/Perfectly-Different-interviews.png",
          "title": "User Research",
          "description": "Direct insights from real people with disabilities to inform product features and emotional design.\n\n—\n\nUser interviews revealed recurring themes of isolation and distrust in mainstream apps, which shaped our focus on transparency and adaptive features."
        },
        {
          "image": "/images/Perfectly-Different-user-needs.jpg",
          "title": "User Needs",
          "description": "A concise list of user goals, pain points, and accessibility priorities that shaped the experience.\n\n—\n\nInsights from users emphasized the importance of control and comfort, guiding our decision to simplify interactions and provide customization where possible."
        },
        {
          "image": "/images/Perfectly-Different-user-type-1.png",
          "title": "User Persona",
          "description": "A representative profile that reflects the motivations and daily challenges of a female user.\n\n—\n\nThis persona captures the desire for emotional safety and ease of communication, leading us to design features that build trust before engagement."
        },
        {
          "image": "/images/Perfectly-Different-user-type-2.png",
          "title": "User Persona",
          "description": "A detailed persona illustrating the emotional and functional needs of a male user.\n\n—\n\nHis profile helped inform content that balances confidence with sensitivity, addressing frustrations with representation in current platforms."
        },
        {
          "image": "/images/Perfectly-Different-scenarios.png",
          "title": "Success Metrics",
          "description": "Scenario-based prompts were designed to explore how we might solve our technical goals and track their success in real-time.\n\n—\n\nWe framed open-ended “How Might We” prompts to challenge assumptions and spark creative UX solutions grounded in real-world user struggles that we could track through systems and metrics."
        },
        {
          "image": "/images/Perfectly-Different-compare.png",
          "title": "Competitive Analysis",
          "description": "An evaluation of existing dating apps to identify market gaps and inclusive opportunities.\n\n—\n\nAnalyzing other dating platforms exposed gaps in accessibility and empathy. We then used these insights to position Perfectly Different as a true alternative."
        },
        {
          "image": "/images/PerfectlyDifferent-screens.png",
          "title": "Concept Application",
          "description": "Initial UI concepts for onboarding and homepage experiences across platforms."
        },
        {
          "image": "/images/Perfectly-Different-app-pages.png",
          "title": "Concept Application",
          "description": "Interactive screens highlighting accessible UX and user-friendly dating interactions."
        },
        {
          "image": "/images/Perfectly-Different-app-preview.png",
          "title": "Concept Application",
          "description": "Additional layouts showcasing how inclusivity is embedded in every design detail."
        },
        {
          "image": "/images/Perfectly-Different-app-layout.png",
          "title": "Concept Application (Visual SiteMap)",
          "description": "A top-down view of the app’s architecture to visualize user flow and functionality."
        }
      ]
    }
  }
}